<template>
  <div>
    <div class="general-section">
      <header class="header">
        <nav class="flex-style">
          <div>
            <svg width="146" height="40" viewBox="0 0 146 40" fill="none" xmlns="http://www.w3.org/2000/svg">
              <path
                  d="M19.9999 40C31.0456 40 39.9999 31.0457 39.9999 20C39.9999 8.9543 31.0456 0 19.9999 0C8.95424 0 -6.10352e-05 8.9543 -6.10352e-05 20C-6.10352e-05 31.0457 8.95424 40 19.9999 40Z"
                  fill="white" fill-opacity="0.1"/>
              <path
                  d="M18.8424 28.0463C14.9124 27.4707 11.8964 24.0828 11.8964 19.9891C11.8964 15.8954 14.9124 12.5075 18.8424 11.9322V7.69238C12.5855 8.29084 7.69232 13.5677 7.69232 19.9891C7.69232 26.4104 12.5855 31.687 18.8424 32.2858V28.0463Z"
                  fill="white"/>
              <path d="M26.9983 12L26.8892 12.3711V23.1393L26.9983 23.2483L31.9968 20.2937L26.9983 12Z" fill="white"/>
              <path d="M26.9984 12L21.9999 20.2937L26.9984 23.2483V18.0217V12Z" fill="white"/>
              <path d="M26.9986 24.8742L26.9371 24.9492V28.7851L26.9986 28.9648L32.0001 21.9211L26.9986 24.8742Z"
                    fill="white"/>
              <path d="M26.9984 28.9648V24.8742L21.9999 21.9211L26.9984 28.9648Z" fill="white"/>
              <path d="M26.9984 23.2482L31.9968 20.2937L26.9984 18.0217V23.2482Z" fill="white"/>
              <path d="M21.9999 20.2937L26.9983 23.2482V18.0217L21.9999 20.2937Z" fill="white"/>
              <path
                  d="M57.2912 27V13.9091H65.8054V15.897H59.6626V19.451H65.3643V21.4389H59.6626V25.0121H65.8565V27H57.2912ZM74.7935 19.5021V21.407H68.9V19.5021H74.7935ZM85.1639 17.5078C85.1042 16.9496 84.8528 16.5149 84.4096 16.2038C83.9707 15.8928 83.3997 15.7372 82.6966 15.7372C82.2023 15.7372 81.7782 15.8118 81.4246 15.9609C81.0709 16.1101 80.8003 16.3125 80.6128 16.5682C80.4253 16.8239 80.3294 17.1158 80.3251 17.4439C80.3251 17.7166 80.3869 17.9531 80.5105 18.1534C80.6383 18.3537 80.8109 18.5241 81.0282 18.6648C81.2456 18.8011 81.4863 18.9162 81.7505 19.0099C82.0148 19.1037 82.2811 19.1825 82.5496 19.2464L83.7768 19.5533C84.2711 19.6683 84.7463 19.8239 85.2023 20.0199C85.6625 20.2159 86.0737 20.4631 86.4359 20.7614C86.8024 21.0597 87.0922 21.4197 87.3052 21.8416C87.5183 22.2635 87.6248 22.7578 87.6248 23.3246C87.6248 24.0916 87.4288 24.767 87.0368 25.3509C86.6447 25.9304 86.078 26.3842 85.3365 26.7124C84.5993 27.0362 83.7065 27.1982 82.6582 27.1982C81.6398 27.1982 80.7555 27.0405 80.0055 26.7251C79.2598 26.4098 78.676 25.9496 78.2541 25.3445C77.8365 24.7393 77.6106 24.0021 77.5765 23.1328H79.9096C79.9437 23.5888 80.0844 23.968 80.3315 24.2706C80.5787 24.5732 80.9004 24.799 81.2967 24.9482C81.6973 25.0973 82.1447 25.1719 82.639 25.1719C83.1547 25.1719 83.6064 25.0952 83.9942 24.9418C84.3862 24.7841 84.693 24.5668 84.9146 24.2898C85.1362 24.0085 85.2491 23.6804 85.2534 23.3054C85.2491 22.9645 85.149 22.6832 84.953 22.4616C84.7569 22.2358 84.4821 22.0483 84.1284 21.8991C83.779 21.7457 83.3699 21.6094 82.9011 21.4901L81.4118 21.1065C80.3336 20.8295 79.4814 20.4098 78.855 19.8473C78.2328 19.2805 77.9217 18.5284 77.9217 17.5909C77.9217 16.8196 78.1305 16.1442 78.5481 15.5646C78.97 14.9851 79.5432 14.5355 80.2676 14.2159C80.992 13.892 81.8123 13.7301 82.7285 13.7301C83.6575 13.7301 84.4714 13.892 85.1703 14.2159C85.8734 14.5355 86.4253 14.9808 86.8258 15.5518C87.2264 16.1186 87.4331 16.7706 87.4459 17.5078H85.1639ZM92.6707 21.2472V27H90.3567V13.9091H92.6195V18.8501H92.7346C92.9647 18.2962 93.3205 17.8594 93.802 17.5398C94.2878 17.2159 94.9057 17.054 95.6557 17.054C96.3376 17.054 96.932 17.1967 97.4391 17.4822C97.9462 17.7678 98.3383 18.1854 98.6153 18.7351C98.8965 19.2848 99.0371 19.956 99.0371 20.7486V27H96.7232V21.1065C96.7232 20.446 96.5528 19.9325 96.2118 19.5661C95.8752 19.1953 95.4022 19.0099 94.7928 19.0099C94.3837 19.0099 94.0172 19.0994 93.6934 19.2784C93.3738 19.4531 93.1224 19.7067 92.9391 20.0391C92.7601 20.3714 92.6707 20.7741 92.6707 21.2472ZM104.941 27.1982C104.319 27.1982 103.759 27.0874 103.26 26.8658C102.766 26.6399 102.374 26.3075 102.084 25.8686C101.798 25.4297 101.656 24.8885 101.656 24.245C101.656 23.6911 101.758 23.233 101.962 22.8707C102.167 22.5085 102.446 22.2188 102.8 22.0014C103.153 21.7841 103.552 21.62 103.995 21.5092C104.443 21.3942 104.905 21.3111 105.382 21.2599C105.957 21.2003 106.424 21.147 106.782 21.1001C107.14 21.049 107.4 20.9723 107.562 20.87C107.728 20.7635 107.811 20.5994 107.811 20.3778V20.3395C107.811 19.858 107.668 19.4851 107.383 19.2209C107.097 18.9567 106.686 18.8246 106.149 18.8246C105.582 18.8246 105.133 18.9482 104.8 19.1953C104.472 19.4425 104.251 19.7344 104.136 20.071L101.975 19.7642C102.146 19.1676 102.427 18.669 102.819 18.2685C103.211 17.8636 103.69 17.5611 104.257 17.3608C104.824 17.1562 105.45 17.054 106.136 17.054C106.609 17.054 107.08 17.1094 107.549 17.2202C108.018 17.331 108.446 17.5142 108.834 17.7699C109.222 18.0213 109.533 18.3643 109.767 18.799C110.006 19.2337 110.125 19.777 110.125 20.429V27H107.901V25.6513H107.824C107.683 25.924 107.485 26.1797 107.229 26.4183C106.978 26.6527 106.661 26.8423 106.277 26.9872C105.898 27.1278 105.452 27.1982 104.941 27.1982ZM105.542 25.4979C106.006 25.4979 106.409 25.4062 106.75 25.223C107.091 25.0355 107.353 24.7884 107.536 24.4815C107.724 24.1747 107.818 23.8402 107.818 23.478V22.321C107.745 22.3807 107.621 22.4361 107.447 22.4872C107.276 22.5384 107.085 22.5831 106.871 22.6214C106.658 22.6598 106.447 22.6939 106.239 22.7237C106.03 22.7536 105.849 22.7791 105.695 22.8004C105.35 22.8473 105.041 22.924 104.768 23.0305C104.496 23.1371 104.281 23.2862 104.123 23.478C103.965 23.6655 103.886 23.9084 103.886 24.2067C103.886 24.6328 104.042 24.9545 104.353 25.1719C104.664 25.3892 105.06 25.4979 105.542 25.4979ZM114.258 30.6818C113.943 30.6818 113.651 30.6563 113.383 30.6051C113.118 30.5582 112.908 30.5028 112.75 30.4389L113.287 28.6364C113.623 28.7344 113.924 28.7813 114.188 28.777C114.452 28.7727 114.685 28.6896 114.885 28.5277C115.089 28.37 115.262 28.1058 115.403 27.7351L115.601 27.2045L112.04 17.1818H114.495L116.758 24.5966H116.86L119.129 17.1818H121.59L117.659 28.1889C117.476 28.7088 117.233 29.1541 116.93 29.5249C116.628 29.8999 116.257 30.1854 115.818 30.3814C115.383 30.5817 114.863 30.6818 114.258 30.6818ZM127.221 27.1726C126.449 27.1726 125.759 26.9744 125.15 26.5781C124.54 26.1818 124.059 25.6065 123.705 24.8523C123.351 24.098 123.175 23.1818 123.175 22.1037C123.175 21.0128 123.354 20.0923 123.712 19.3423C124.074 18.5881 124.562 18.0192 125.175 17.6357C125.789 17.2479 126.473 17.054 127.227 17.054C127.802 17.054 128.275 17.152 128.646 17.348C129.017 17.5398 129.311 17.772 129.528 18.0447C129.746 18.3132 129.914 18.5668 130.033 18.8054H130.129V13.9091H132.449V27H130.174V25.4531H130.033C129.914 25.6918 129.741 25.9453 129.515 26.2138C129.29 26.478 128.991 26.7038 128.621 26.8913C128.25 27.0788 127.783 27.1726 127.221 27.1726ZM127.866 25.2741C128.356 25.2741 128.774 25.142 129.119 24.8778C129.464 24.6094 129.726 24.2365 129.905 23.7592C130.084 23.282 130.174 22.7259 130.174 22.0909C130.174 21.456 130.084 20.9041 129.905 20.4354C129.731 19.9666 129.471 19.6023 129.126 19.3423C128.785 19.0824 128.365 18.9524 127.866 18.9524C127.351 18.9524 126.92 19.0866 126.575 19.3551C126.23 19.6236 125.97 19.9943 125.795 20.4673C125.621 20.9403 125.533 21.4815 125.533 22.0909C125.533 22.7045 125.621 23.2521 125.795 23.7337C125.974 24.2109 126.236 24.5881 126.582 24.8651C126.931 25.1378 127.359 25.2741 127.866 25.2741ZM139.918 27.1918C138.959 27.1918 138.128 26.9808 137.425 26.5589C136.722 26.1371 136.176 25.5469 135.789 24.7884C135.405 24.0298 135.213 23.1435 135.213 22.1293C135.213 21.1151 135.405 20.2266 135.789 19.4638C136.176 18.701 136.722 18.1087 137.425 17.6868C138.128 17.2649 138.959 17.054 139.918 17.054C140.877 17.054 141.708 17.2649 142.411 17.6868C143.114 18.1087 143.657 18.701 144.041 19.4638C144.428 20.2266 144.622 21.1151 144.622 22.1293C144.622 23.1435 144.428 24.0298 144.041 24.7884C143.657 25.5469 143.114 26.1371 142.411 26.5589C141.708 26.9808 140.877 27.1918 139.918 27.1918ZM139.931 25.3381C140.451 25.3381 140.885 25.1953 141.235 24.9098C141.584 24.62 141.844 24.2322 142.014 23.7464C142.189 23.2607 142.277 22.7195 142.277 22.1229C142.277 21.522 142.189 20.9787 142.014 20.4929C141.844 20.0028 141.584 19.6129 141.235 19.3232C140.885 19.0334 140.451 18.8885 139.931 18.8885C139.398 18.8885 138.955 19.0334 138.601 19.3232C138.252 19.6129 137.99 20.0028 137.815 20.4929C137.644 20.9787 137.559 21.522 137.559 22.1229C137.559 22.7195 137.644 23.2607 137.815 23.7464C137.99 24.2322 138.252 24.62 138.601 24.9098C138.955 25.1953 139.398 25.3381 139.931 25.3381Z"
                  fill="white"/>
            </svg>
          </div>
          <div>
            <e-menu-list
                :list="navbarMenuList"
            />
          </div>
        </nav>
      </header>
      <section>
        <h1 class="main-title-style">Чистая установка Windows 10 - пошаговая инструкция</h1>
        <p>1. Скачать утилиту для загрузки образа Windows 10 вы можете на этой странице: <a
            href="https://www.microsoft.com/ru-ru/software-download/windows10" target="_blank">Скачать Windows 10</a>
        </p>
        <e-instruction text="2. Запишите загрузочный DVD для установки или создайте загрузочный USB носитель"/>
        <e-instruction text="3. Загрузите компьютер с установочного носителя"/>
        <e-instruction text="4. Выберите языковые предпочтения и нажмите кнопку Далее"/>
        <img src="../assets/img/instruction/img-1.png" alt="img">
        <e-instruction text="5. Нажмите кнопку Установить для начала процедуры установки Windows"/>
        <img src="../assets/img/instruction/img-2.png" alt="img">
        <e-instruction text="6. Прочитайте и примите условия лицензионного соглашения"/>
        <img src="../assets/img/instruction/img-3.png" alt="img">
        <e-instruction
            text="7. Выберите тип установки Выборочная: только установка Windows (для опытных пользователей)"/>
        <img src="../assets/img/instruction/img-4.png" alt="img">
        <e-instruction text="8. Выбор раздела установки"/>
        <e-instruction text="A."/>
        <img src="../assets/img/instruction/img-5.png" alt="img">
        <e-instruction text="В. Установка Windows 10 с UEFI"/>
        <e-instruction class="ml-1"
                       text="Удалите все разделы на целевом диске. После этого нажмите кнопку Создать и выберите все доступное пространство для создания раздела."/>
        <e-instruction class="ml-1" text="При этом будут созданы 4 раздела на диске:"/>
        <e-instruction class="ml-2" text="Раздел 1: Среда восстановления. Содержит среду восстановления"/>
        <e-instruction class="ml-2"
                       text="Раздел 2: Системный раздел (EFI). Содержит хранилище конфигурации загрузки (BCD) и файлы, необходимые для загрузки операционной системы."/>
        <e-instruction class="ml-2"
                       text="Раздел 3: MSR (зарезервировано системой). Необходим для служебных операций встроенного и стороннего ПО (например, конвертирование простого диска в динамический)."/>
        <e-instruction class="ml-2" text="Раздел 4: Система. На этом разделе будет расположена установленная система."/>
        <img src="../assets/img/instruction/img-6.png" alt="img">
        <e-instruction
            text="9. После выбора диска начнется процесс установки Windows 10. Во время установки экран может ненадолго гаснуть, а компьютер будет несколько раз перезагружен для завершения некоторых этапов установки."/>
        <img src="../assets/img/instruction/img-7.png" alt="img">
        <e-instruction
            text="10. На следующем этапе вам предстоит выбрать базовые параметры персонализации и местоположения, а также подключения и отчетов об ошибках. Здесь вы можете выбрать вариант Использовать стандартные параметры (по умолчанию) или указать настройки вручную."/>
        <img src="../assets/img/instruction/img-8.png" alt="img">
        <e-instruction
            text="11. На следующем этапе выберите режим использования компьютера в сети. Если это домашний компьютер, выберите вариант Я владею этим компьютером. Если же компьютер следует подключить к доменной сети, выберите вариант Моя организация."/>
        <img src="../assets/img/instruction/img-9.png" alt="img">
        <e-instruction text="12. Создание учетной записи"/>
        <e-instruction class="ml-1"
                       text="А. Вход в систему с учетной записью Microsoft: введите адрес электронной почты и пароль учетной записи Microsoft. Здесь же вы можете создать новую учетную запись Microsoft если у вас ее еще нет."/>
        <img src="../assets/img/instruction/img-10.png" alt="img">
        <e-instruction
            text="О преимуществах использования этого типа учетной записи читайте в статье 5 веских причин использовать учетную запись MicrosoftЕсли вы используете двухступенчатую авторизацию в учетной записи Microsoft, то вам понадобится выбрать вариант получения проверочного кода: на телефон или дополнительный адрес электронной почты, указанный в учетной записи Microsoft."/>
        <e-instruction text="В. Создание локальной учетной записи."/>
        <e-instruction
            text="Этот вариант может пригодиться в первую очередь при отсутствии подключения к интернет. Вы можете нажать ссылку Пропустить этот шаг и перейти к мастеру создания локальной учетной записи. В последующем вы сможете выполнить вход в учетную запись Microsoft из локальной учетной записи. Все ваши настройки и пользовательские данные при этом останутся нетронутыми."/>
        <img src="../assets/img/instruction/img-11.png" alt="img">
        <e-instruction
            text="С. Если вы выполнили вход при помощи учетной записи Microsoft, то вам будет доступна авторизация в Windows при помощи ПИН-кода. Вы можете воспользоваться такой возможностью нажав кнопку Использовать ПИН-код или пропустить этот шаг."/>
        <img src="../assets/img/instruction/img-12.png" alt="img" style="margin-bottom: 24px">
        <img src="../assets/img/instruction/img-13.png" alt="img">
        <e-instruction
            text="13. Если вы хотите использовать синхронизацию с One Drive, то на следующем шаге нажмите кнопку Далее. В противном случае выберите вариант По умолчанию сохранять новые файлы только на этом ПК."/>
        <img src="../assets/img/instruction/img-14.png" alt="img">
        <e-instruction
            text="14. После загрузки рабочего стола вам остается только выбрать режим доступа к вашему компьютеру по локальной сети."/>
        <img src="../assets/img/instruction/img-15.png" alt="img">
      </section>
    </div>
    <e-footer/>
  </div>
</template>

<script>
import EMenuList from "@/components/e-menu-list.vue";
import EInstruction from "@/components/e-instruction.vue";
import EFooter from "@/components/e-footer.vue";

export default {
  name: "windows-page",
  components: {
    EInstruction,
    EMenuList,
    EFooter
  },
  data() {
    return {
      navbarMenuList: ['Продукты', 'Функции', 'Про нас', 'Контакты', 'Вход']
    }
  }
}
</script>

<style scoped>
* {
  margin: 0;
  padding: 0;
  font-family: 'Arial', sans-serif;
}

.general-section {
  background-color: #0D0D2B;
  padding: 60px 150px;
}

.flex-style {
  display: flex;
  align-items: center;
  justify-content: space-between;
}

p {
  color: #fff;
  font-weight: 400;
  font-size: 14px;
  margin-bottom: 12px;
}

.main-title-style {
  font-weight: 700;
  font-size: 27px;
  text-align: center;
  color: #FFFFFF;
  margin: 70px auto;
}

a {
  color: #fff;
}

img {
  margin-left: 60px;
}

.ml-1 {
  margin-left: 20px;
}

.ml-2 {
  margin-left: 40px;
}

.ml-3 {
  margin-left: 60px;
}
</style>